Revit 2024 API
DockablePane.Hide Method
 If the pane is on screen, hide it. Has no effect on built-in Revit dockable panes.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void Hide()
Visual Basic
Public Sub Hide
Visual C++
public:
void Hide()
See Also
DockablePane Class
Autodesk.Revit.UI Namespace